import re
import pandas as pd


def preprocess(df, name):
	if name in ['სკოლების ინფრასტრუქტურა', 'სკოლების ინფრასტრუქტურული მდგომარეობა']:
		if name == 'სკოლების ინფრასტრუქტურა':
			df = df.rename(columns={"საიდენტიფიკაციო კოდი (ცხრანიშნა) ": "კოდი (ცხრანიშნა)"}, )
		df = df.drop(columns='შენიშვნა')

	elif name == 'სკოლების შემოსავლები და გასავლები':
		df = df.drop(columns=['№'])
		df = df.rename(columns={"სკოლის დასახელება": "სკოლის სახელწოდება", "რაიონი": "ქალაქი/მუნიციპალიტეტი",
								"საიდენტიფიკაციო კოდი": "კოდი (ცხრანიშნა)"})

		df = df.rename(columns={'მ.შ. პრემია': "მ.შ. დირექცია, ადმინისტრაციულ-ტექნიკური-პერსონალის პრემია",
								'პრემია': "მ.შ. მასწავლებელთა პრემია",
								"პრემია.1": "მ.შ. სპეც მასწავლებელთა პრემია",
								'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები )': 'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები)',
								'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის სპეც მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები )': 'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის სპეც მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები)',
								})

	elif name == 'მოსწავლეთა რაოდენობა':
		df = df.drop(columns=['№', "საიდენტიფიკაციო კოდი", 'სკოლის ტიპი'])
		df = df.rename(columns={
			"სკოლის დასახელება": "სკოლის სახელწოდება",
			"რაიონი": "ქალაქი/მუნიციპალიტეტი",
			"საიდენტიფიკაციო კოდი.1": "კოდი (ცხრანიშნა)",
			"Code": "კოდი (ოთხნიშნა)",
			"სულ მოსწ. რაოდენობა ": "მოსწავლეთა რაოდენობა"})

		new_order = [
			'რეგიონი',
			'ქალაქი/მუნიციპალიტეტი',
			'სკოლის სახელწოდება',
			'კოდი (ოთხნიშნა)',
			'კოდი (ცხრანიშნა)',
			'მოსწავლეთა რაოდენობა'
		]
		df = df[new_order]

	df.columns = df.columns.str.strip()

	prefixes = ['სსიპ - ', 'სსიპ ', 'სსიპ-', 'სსიპ -', 'სსიპ', 'სსიპ- ']

	for prefix in prefixes:
		df['სკოლის სახელწოდება'] = df['სკოლის სახელწოდება'].str.replace(f'^{prefix}', '', regex=True).str.strip()

	df['სკოლის სახელწოდება'] = 'სსიპ - ' + df['სკოლის სახელწოდება']
	df['რეგიონი'] = df['რეგიონი'].apply(lambda x: re.sub(r'\n', '', x)).str.strip()
	return df


df1 = pd.read_excel('../../../../Data/original/სკოლების ინფრასტრუქტურა.xlsx')
df2 = pd.read_excel('../../../../Data/original/სკოლების ინფრასტრუქტურული მდგომარეობა.xlsx')
df3 = pd.read_excel('../../../../Data/original/სკოლების შემოსავლები და გასავლები.xlsx')
df4 = pd.read_excel('../../../../Data/original/მოსწ. რაოდენობა.xlsx')

df1 = preprocess(df1, 'სკოლების ინფრასტრუქტურა')
df2 = preprocess(df2, 'სკოლების ინფრასტრუქტურული მდგომარეობა')
df3 = preprocess(df3, 'სკოლების შემოსავლები და გასავლები')
df4 = preprocess(df4, 'მოსწავლეთა რაოდენობა')

# # Save the data to a new Excel file
df1.to_excel('../../../../Data/modified/modified სკოლების ინფრასტრუქტურა.xlsx', index=False)
df2.to_excel('../../../../Data/modified/modified სკოლების ინფრასტრუქტურული მდგომარეობა.xlsx', index=False)
df3.to_excel('../../../../Data/modified/modified სკოლების შემოსავლები და გასავლები.xlsx', index=False)
df4.to_excel('../../../../Data/modified/modified მოსწავლეთა რაოდენობა.xlsx', index=False)
