import re

import numpy as np
import pandas as pd

df = pd.read_excel('../../Data/original/სკოლების შემოსავლები და გასავლები.xlsx')


def preprocess(df):
	prefixes = ['სსიპ - ', 'სსიპ ', 'სსიპ-', 'სსიპ -', 'სსიპ', 'სსიპ- ']

	# Remove the prefixes from the beginning of each school name
	for prefix in prefixes:
		df['სკოლის დასახელება'] = df['სკოლის დასახელება'].str.replace(f'^{prefix}', '', regex=True).str.strip()

	df['სკოლის დასახელება'] = 'სსიპ - ' + df['სკოლის დასახელება']

	df = df.drop(columns=['№'])
	df = df.rename(columns={"სკოლის დასახელება": "სკოლის სახელწოდება", "რაიონი": "ქალაქი/მუნიციპალიტეტი",
							"საიდენტიფიკაციო კოდი": "კოდი (ცხრანიშნა)",
							'მ.შ. პრემია': "მ.შ. დირექცია, ადმინისტრაციულ-ტექნიკური-პერსონალის პრემია",
							'პრემია': "მ.შ. მასწავლებელთა პრემია",
							"პრემია.1": "მ.შ. სპეც მასწავლებელთა პრემია",
							'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები )': 'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები)',
							'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის სპეც მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები )': 'საქართველოს განათლებისა და მეცნიერების სამინისტროდან მიღებული დაფინანსება (სკოლის სპეც მასწავლებლის სქემის შესაბამისად განსაზღვრული დანამატები)',
							})

	df.columns = df.columns.str.strip()
	return df


# save the data to a new Excel file
df.to_excel('../../Data/modified/modified სკოლების შემოსავლები და გასავლები.xlsx', index=False)
